INSERT INTO `railway`.`station` (`station`)
VALUES
    ('Київ'),
    ('Харків'),
    ('Одеса'),
    ('Дніпро'),
    ('Львів'),
    ('Запоріжжя'),
    ('Кривий Ріг'),
    ('Миколаїв'),
    ('Маріуполь'),
    ('Вінниця'),
    ('Херсон'),
    ('Полтава'),
    ('Чернігів'),
    ('Черкаси'),
    ('Житомир'),
    ('Суми'),
    ('Рівне'),
    ('Горішні Плавні'),
    ('Кам\'янське'),
    ('Івано-Франківськ'),
    ('Кременчук'),
    ('Тернопіль'),
    ('Калуш'),
    ('Коломия'),
    ('Мукачево'),
    ('Ужгород'),
    ('Сімферополь'),
    ('Ялта'),
    ('Севастополь'),
    ('Керч'),
    ('Феодосія'),
    ('Євпаторія'),
    ('Нікополь'),
    ('Кропивницький'),
    ('Мелітополь'),
    ('Слов\'янськ'),
    ('Бердянськ'),
    ('Умань'),
    ('Хмельницький'),
    ('Муроване Поле'),
    ('Кременець'),
    ('Шостка'),
    ('Біла Церква'),
    ('Нововолинськ'),
    ('Новоград-Волинський'),
    ('Луцьк'),
    ('Ковель');


INSERT INTO `railway`.`train` (`number`)
VALUES ('123A'), ('456B'), ('789C'), ('ABC1'), ('DEF2');

INSERT INTO `railway`.`route` (`name`, `number`, `train_id`) VALUES
                                                                 ('Київ-Львів', 101, 25),
                                                                 ('Львів-Київ', 102, 25),
                                                                 ('Київ-Харків', 103, 26),
                                                                 ('Харків-Київ', 104, 26),
                                                                 ('Львів-Одеса', 105, 27),
                                                                 ('Одеса-Львів', 106, 27);

INSERT INTO `railway`.`station_has_route` (`station_arrival`, `station_dispatch`, `station_order`, `route_id`,
                                           `station_id`)
VALUES ('2023-03-01 08:00:00', '2023-03-01 07:00:00', 1, 31, 48),
       ('2023-03-01 10:20:00', '2023-03-01 10:22:00', 2, 31, 57),
       ('2023-03-01 12:30:00', '2023-03-01 12:35:00', 3, 31, 86),
       ('2023-03-01 15:00:00', '2023-03-01 15:02:00', 4, 31, 69),
       ('2023-03-01 18:00:00', '2023-03-01 18:05:00', 5, 31, 52);

INSERT INTO railway.station_has_route (station_arrival, station_dispatch, station_order, route_id, station_id)
VALUES
    ('2023-03-02 08:05:00', '2023-03-02 07:05:00', 1, 32, 52),
    ('2023-03-02 11:05:00', '2023-03-02 11:10:00', 2, 32, 69),
    ('2023-03-02 13:35:00', '2023-03-02 13:37:00', 3, 32, 86),
    ('2023-03-02 15:45:00', '2023-03-02 15:50:00', 4, 32, 57),
    ('2023-03-02 18:00:00', '2023-03-02 17:00:00', 5, 32, 48);
